; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 82)
	(= (value c1) 39)
	(= (value c2) 48)
	(= (value c3) 89)
	(= (value c4) 19)
	(= (value c5) 1)
	(= (value c6) 10)
	(= (value c7) 1)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 7
2. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 7
3. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 7
4. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 7
5. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 7
6. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 7
7. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 7
8. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 7
9. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 3 of 7
10. (increment c7)
   changed: (value c7) from 1 to 6
   goals met: 3 of 7
11. (increment c7)
   changed: (value c7) from 6 to 11
   goals met: 4 of 7
12. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 7
13. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 7
14. (increment c5)
   changed: (value c5) from 1 to 7
   goals met: 4 of 7
15. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 7
16. (increment c5)
   changed: (value c5) from 7 to 14
   goals met: 3 of 7
17. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 7
18. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 7
19. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 3 of 7
20. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 3 of 7
21. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 3 of 7
22. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 3 of 7
23. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 3 of 7
24. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 3 of 7
25. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 3 of 7
26. (increment c1)
   changed: (value c1) from 39 to 45
   goals met: 3 of 7
27. (increment c1)
   changed: (value c1) from 45 to 51
   goals met: 2 of 7
28. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 2 of 7
29. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 2 of 7
30. (increment c1)
   changed: (value c1) from 51 to 59
   goals met: 2 of 7
31. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 2 of 7
32. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 2 of 7
33. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 7
34. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 7
35. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 2 of 7
36. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 2 of 7
37. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 2 of 7
38. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 2 of 7
39. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 2 of 7
40. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 2 of 7
41. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 2 of 7
42. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 2 of 7
43. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 2 of 7
44. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 2 of 7
45. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 2 of 7
46. (decrement c5)
   changed: (value c5) from 14 to 7
   goals met: 3 of 7
47. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 3 of 7
48. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 3 of 7
49. (increment c4)
   changed: (value c4) from 19 to 27
   goals met: 3 of 7
50. (increment c5)
   changed: (value c5) from 7 to 14
   goals met: 2 of 7
51. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 2 of 7
52. (increment c4)
   changed: (value c4) from 27 to 36
   goals met: 2 of 7
53. (increment c4)
   changed: (value c4) from 36 to 45
   goals met: 2 of 7
54. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 2 of 7
55. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 2 of 7
56. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 2 of 7
57. (decrement c3)
   changed: (value c3) from 89 to 84
   goals met: 2 of 7
58. (decrement c3)
   changed: (value c3) from 84 to 79
   goals met: 2 of 7
59. (decrement c3)
   changed: (value c3) from 79 to 74
   goals met: 2 of 7
60. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 2 of 7
61. (decrement c3)
   changed: (value c3) from 74 to 69
   goals met: 2 of 7
62. (decrement c3)
   changed: (value c3) from 69 to 64
   goals met: 2 of 7
63. (decrement c3)
   changed: (value c3) from 64 to 59
   goals met: 2 of 7
64. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 2 of 7
65. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 2 of 7
66. (decrement c0)
   changed: (value c0) from 82 to 77
   goals met: 2 of 7
67. (decrement c0)
   changed: (value c0) from 77 to 72
   goals met: 2 of 7
68. (decrement c0)
   changed: (value c0) from 72 to 67
   goals met: 2 of 7
69. (decrement c0)
   changed: (value c0) from 67 to 62
   goals met: 2 of 7
70. (decrement c0)
   changed: (value c0) from 62 to 57
   goals met: 3 of 7
71. (increment c2)
   changed: (value c2) from 48 to 50
   goals met: 3 of 7
72. (decrement c1)
   changed: (value c1) from 59 to 49
   goals met: 3 of 7
73. (decrement c0)
   changed: (value c0) from 57 to 52
   goals met: 3 of 7
74. (decrement c0)
   changed: (value c0) from 52 to 47
   goals met: 4 of 7
75. (decrement c5)
   changed: (value c5) from 14 to 4
   goals met: 5 of 7
76. (decrement c4)
   changed: (value c4) from 45 to 35
   goals met: 5 of 7
77. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 5 of 7
78. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 5 of 7
79. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 5 of 7
80. (decrement c3)
   changed: (value c3) from 59 to 51
   goals met: 5 of 7
81. (increment c5)
   changed: (value c5) from 4 to 14
   goals met: 4 of 7
82. (increment c5)
   changed: (value c5) from 14 to 24
   goals met: 4 of 7
83. (increment c5)
   changed: (value c5) from 24 to 34
   goals met: 4 of 7
84. (decrement_rate c5)
   changed: (rate_value c5) from 10 to 9
   goals met: 4 of 7
85. (decrement c5)
   changed: (value c5) from 34 to 25
   goals met: 4 of 7
86. (decrement c5)
   changed: (value c5) from 25 to 16
   goals met: 4 of 7
87. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 4 of 7
88. (increment c5)
   changed: (value c5) from 16 to 26
   goals met: 4 of 7
89. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 7
90. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 7
91. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 7
92. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 7
93. (increment c6)
   changed: (value c6) from 10 to 14
   goals met: 3 of 7
94. (increment c7)
   changed: (value c7) from 11 to 16
   goals met: 4 of 7
95. (increment c6)
   changed: (value c6) from 14 to 18
   goals met: 3 of 7
96. (increment c7)
   changed: (value c7) from 16 to 21
   goals met: 4 of 7
97. (increment c6)
   changed: (value c6) from 18 to 22
   goals met: 3 of 7
98. (increment c7)
   changed: (value c7) from 21 to 26
   goals met: 4 of 7
99. (increment c6)
   changed: (value c6) from 22 to 26
   goals met: 3 of 7
100. (increment c7)
   changed: (value c7) from 26 to 31
   goals met: 4 of 7
101. (increment c6)
   changed: (value c6) from 26 to 30
   goals met: 5 of 7
102. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 5 of 7
103. (increment c6)
   changed: (value c6) from 30 to 34
   goals met: 4 of 7
104. (increment c7)
   changed: (value c7) from 31 to 36
   goals met: 5 of 7
105. (increment c6)
   changed: (value c6) from 34 to 38
   goals met: 5 of 7
106. (increment c7)
   changed: (value c7) from 36 to 41
   goals met: 6 of 7
107. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 5 of 7
108. (increment c5)
   changed: (value c5) from 36 to 46
   goals met: 5 of 7
109. (increment c6)
   changed: (value c6) from 38 to 42
   goals met: 4 of 7
110. (increment c7)
   changed: (value c7) from 41 to 46
   goals met: 5 of 7
111. (increment c6)
   changed: (value c6) from 42 to 46
   goals met: 4 of 7
112. (increment c7)
   changed: (value c7) from 46 to 51
   goals met: 5 of 7
113. (increment c6)
   changed: (value c6) from 46 to 50
   goals met: 6 of 7
114. (increment c4)
   changed: (value c4) from 45 to 55
   goals met: 6 of 7
115. (increment c5)
   changed: (value c5) from 46 to 56
   goals met: 6 of 7
116. (increment c6)
   changed: (value c6) from 50 to 54
   goals met: 5 of 7
117. (increment c7)
   changed: (value c7) from 51 to 56
   goals met: 6 of 7
118. (increment c6)
   changed: (value c6) from 54 to 58
   goals met: 6 of 7
119. (increment c7)
   changed: (value c7) from 56 to 61
   goals met: 7 of 7
